Autodesk.Revit.DB.ReferencePoint.ShowNormalReferencePlaneOnly
Whether all three coordinate planes are shown, or only the
normal (XY) plane.

Autodesk.Revit.DB.ReferencePoint.CoordinatePlaneVisibility
Visibility settings for the coordinate reference planes.

Autodesk.Revit.DB.ReferencePoint.GetHubId
Id of associated Hub.

Autodesk.Revit.DB.ReferencePoint.SetVisibility(Autodesk.Revit.DB.FamilyElementVisibility)
Sets the visibility for the point.
Remarks: The visibility of the point can be changed for different
types of views and detail levels in the project.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when visibility is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when regeneration failed.

Autodesk.Revit.DB.ReferencePoint.GetVisibility
Gets the visibility for the point.
Returns: A copy of visibility settings for the
ReferencePoint.

Autodesk.Revit.DB.ReferencePoint.Visible
Whether the point is visible when the family is loaded
into a project.

Autodesk.Revit.DB.ReferencePoint.GetCoordinatePlaneReferenceXZ
A reference for the XZ plane of the coordinate
system.

Autodesk.Revit.DB.ReferencePoint.GetCoordinatePlaneReferenceYZ
A reference for the YZ plane of the coordinate
system.

Autodesk.Revit.DB.ReferencePoint.GetCoordinatePlaneReferenceXY
A reference for the XY plane of the coordinate
system.

Autodesk.Revit.DB.ReferencePoint.GetInterpolatingCurves
The set of CurveByPoints elements that interpolate
a ReferencePoint.
Remarks: A CurveByPoints is in the Autodesk.Revit.DB.ReferencePoint.GetInterpolatingCurves
array if and only if the ReferencePoint is in the Points array of
Autodesk.Revit.DB.CurveByPoints.

Autodesk.Revit.DB.ReferencePoint.Position
The position of the ReferencePoint.
Remarks: This is an alternate interface to the property
CoordinateSystem.Origin. When set, the effect is the same
as setting the CoordinateSystem property to the same as
its current value but with a different Origin.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when CoordinateSystem is set while the Reference
property is not null, and the ReferencePoint is unable to
move to the new location.

Autodesk.Revit.DB.ReferencePoint.SetCoordinateSystem(Autodesk.Revit.DB.Transform)
The position and orientation of the ReferencePoint.
Remarks: The position of the point is given by
CoordinateSystem.Origin, and the orientation is specified
by the three unit vectors CoordinateSystem.BasisX, BasisY,
BasisZ. The basis vectors must be unit length and mutually
perpendicular.
Whenever the Reference property is not null,
changing the CoordinateSystem property has a compound
effect. First the point is moved to the specified
location. Then the point is moved to conform to its
Reference, by the shortest possible distance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when coordinateSystem does not specify an
orthonormal basis.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when CoordinateSystem is set while the Reference
property is not null, and the ReferencePoint is unable to
move to the new location.

Autodesk.Revit.DB.ReferencePoint.GetCoordinateSystem
The position and orientation of the ReferencePoint.
Remarks: The position of the point is given by
CoordinateSystem.Origin, and the orientation is specified
by the three unit vectors CoordinateSystem.BasisX, BasisY,
BasisZ.

Autodesk.Revit.DB.ReferencePoint.SetPointElementReference(Autodesk.Revit.DB.PointElementReference)
Change the rule for computing the
location of the ReferencePoint relative to other elements in
the document.
Remarks: pointElementReference may be null, in which case the ReferencePoint
does not follow any other element. When Reference is changed
from null to a non-null value, the point moves and rotates
to the prescribed location and orientation. Where the
coordinate system has some freedom, it will remain as close
to the old orientation as possible. When
the reference is set to null, the point does not move or
rotate.
pointElementReference: An object specifying
a rule for the location and orientation of a ReferencePoint.
(Note: The ReferencePoint object does not store the
pointElementReference object after this call.)
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when Reference is set to a non-null object, and the
ReferencePoint is unable to move to the new reference.

Autodesk.Revit.DB.ReferencePoint.GetPointElementReference
Retrieve a copy of the rule that computes the
location of the ReferencePoint relative to other elements in
the document.
Returns: A PointElementReference object, or null if the
ReferencePoint does not have a reference.

Autodesk.Revit.DB.ReferencePoint
A reference point in an Autodesk Revit family.
Remarks: A ReferencePoint represents a point in space together
with a local coordinate system. ReferencePoints can be free, or
constrained to other elements in several ways. When the point is
constrained, the coordinate system is also constrained in certain
ways.